#ifndef _SEMAPHORE_INIT_H
#define _SEMAPHORE_INIT_H
#include "FreeRTOS.h"
#include "semphr.h"
#include "event_groups.h"

void LY_TaskCreate_semaphore_init(void);

/* 任务句柄 */


/*信号量，队列，标志组，通知*/
extern SemaphoreHandle_t 	Uart1Semaphore;			//互斥串口1信号量
extern QueueHandle_t     	Uart1_Message_Queue;	//信息队列句柄
extern SemaphoreHandle_t 	TestSemaphore;			//测试二值信号量
extern EventGroupHandle_t  	Test_Group;				//测试事件标志组
//================================================================================================================\\
//=============================================用户数据区========================================================\\
//================================================================================================================\\.
typedef struct{
	u8 data;
}SHEET;
extern SHEET DATA_SHEET;
//================================================================================================================\\
//=============================================store.h文件========================================================\\
//================================================================================================================\\
/* 掉电数据放置区 */
//===================\\
/*  掉电数据结构体   */
typedef struct {
	u32 u32Crc;									//CRC
	u32 MAGIC;									//MAGIC
	u8 				STATUS;						//STATUS    掉电状态  = 1 正常掉电， = 2 特殊掉电， = 0 死机掉电。
	u32 			NULLL;						//NULL
}STORE_SHEET;
extern STORE_SHEET DATA_STORE;
//================================================================================================================\\

#endif


